#include <locale.h>

#include "client_ui.h"

int initialize_terminal(void) {
  int err = 0;
  setlocale(LC_ALL, "");
  initscr();

  // выключаем ожидание нажатия Enter после ввода с клавиатуры
  if (ERR == cbreak()) {
    fprintf(stderr,
            "Ошибка инициализации: "
            "не удалось выключить буферизацию строк.\n");
    err = -1;
  }
  if (0 == err && ERR == noecho()) {  // не писать в терминал нажатые клавиши
    fprintf(stderr,
            "Ошибка инициализации: "
            "не удалось выключить отображение ввода.\n");
    err = -2;
  }
  if (ERR == curs_set(1)) {  // отображать курсор
    fprintf(stderr,
            "Ошибка инициализации: "
            "не удалось включить отображение курсора.\n");
    err = -3;
  }

  // отключаем сброс вывода в очереди драйвера терминала при нажатии клавиш,
  // вызывающих прерывание. Возможно интерфейс будет не таким отзывчивым,
  // но зато библиотека ncurses будет иметь точное представление
  // о содержимом терминала. Во всяком случае, man советует делать так.
  if (ERR == intrflush(stdscr, FALSE)) {
    fprintf(stderr,
            "Ошибка инициализации: "
            "не удалось выключить сброс вывода в очереди драйвера терминала "
            "при нажатии клавиш, вызывающих прерывание.\n");
    err = -4;
  }

  // Включаем режим простой работы с функциональными клавишами,
  // чтобы не обрабатывать управляющие последовательности вручную,
  // а сразу забирать значения функциональных клавиш через wgetch.
  // Опять же по совету из man.
  if (ERR == keypad(stdscr, TRUE)) {
    fprintf(stderr,
            "Ошибка инициализации: "
            "не удалось включить режим простой работы с функциональными "
            "клавишами.\n");
    err = -5;
  }

  // init_colors();

  return 0;
}
